---
kind: method
id: M:Autodesk.Revit.DB.STLExportOptions.IsMaxEdgeLengthSet
source: html/c41f7f4d-8563-5319-1fba-528e4d5e73d5.htm
---
# Autodesk.Revit.DB.STLExportOptions.IsMaxEdgeLengthSet Method

Checks whether the MaxEdgeLength tessellation parameter is explicitly set.

## Syntax (C#)
```csharp
public bool IsMaxEdgeLengthSet()
```

## Returns
True if MaxEdgeLength tessellation parameter is explicitly set, false otherwise.